import { Container } from "react-bootstrap";
import MyNavbar from "../../components/Navbar/Navbar";
import logo from '../../assets/Images/codeTime.png'
import aboutPic from '../../assets/Images/Monitor codetime.jpg'
import Footer from "../../components/Footer/Footer";


function About() {
    return (
        <div>
            <MyNavbar />
            <Container style={{ textAlign: 'justify' }} >
                <div className="text-center"><img className="rounded-circle" src={logo} /></div>
                <h1 style={{ fontFamily: 'Lalezar' }}>تاریخچه کد تایم</h1>
                <p>گامهای نخست راه اندازی پروژه کد تایم، در سال ۱۳۸۷ با ارائه آموزش های مرتبط با هوش مصنوعی و برنامه نویسی برداشته شد. کد تایم، پس از مدت کوتاهی، در زمستان ۱۳۹۰، توانست عنوان بهترین پروژه آنلاین آموزشی ایران به انتخاب کاربران را در چهارمین جشنواره وب ایران کسب کرده و در ادامه به صورت گام به گام، مسیر تبدیل شدن به بزرگترین پلتفرم دروس دانشگاهی کشور را طی کرد.</p>

                <h2 style={{ fontFamily: 'Lalezar' }}>ویژگی های وب سایت کد تایم</h2>
                <ul>
                    <li>پرسش و پاسخ آنلاین با مدرسین دوره های آموزشی</li>
                    <li>پشتیبانی  دوره های آموزشی همراه با تیم کد تایم</li>
                    <li>سیستم امتیازدهی هوشمند برای کاربران وبسایت</li>
                    <li>تخفیفهای ویژه و لحظه ای در پیج اینستاگرام </li>
                </ul>
                <p>ما از ابتدای مسیر یادگیری تا تبدیل شدن به برنامه نویس کاملا پشتیبان شما هستیم در آموزش های  کدتایم  به شما کمک میکنیم که یادگیری با شیب ملایم را دنبال کنید و همکار روانشناس ما در طول مسیر برای مشاوره همراه شماست سعی داریم با معرفی به شرکت های همکار در انتهای دوره های  برنامه نویسی مسیر درآمدزایی هموارتری را داشته باشید.</p>

                <h2 style={{ fontFamily: 'Lalezar' }}>آرمان کدتایم</h2>
                <p> اعتقاد داریم که دانش ماندگارترین ابزار تغییر است و می خواهیم با تمرکز بر گسترش سطوح آموزش دانشگاهی، نقش خود را در مسیر تغییر بازی کنیم. کد تایم همان دانش دانشگاهی در دسترس همگان است و هدف ما رسیدن به روزی است که دانش دانشگاهی بدون واسطه، در دسترس همگان باشد. ما خود را آغاز پایان آموزش سنتی در ایران و اولین قدم های شروع تعریف آینده از آموزش دانشگاهی می دانیم و این را نه تنها ما که تمام بیش از 14000 دانشجوی دانشگاه آنلاین کد تایم باورمند هستند.

                کد تایم پوست اندازی بزرگی را در قالب یک پروژه جامع آموزش دانشگاهی، تجربه می کند که همزمان است با گسترش این پروژه به خارج از حوزه هوش مصنوعی و افزودن رشته های دانشگاهی دیگر. کد تایم نسخه آینده دانشگاهها در ایران را تعریف خواهد کرد.
                </p>

                <h2 style={{ fontFamily:'Lalezar'}}>
                    آموزش به زبان های زنده دنیا
                </h2>
                <p>
                    مفتخریم که به عنوان اولین آموزشگاه ایرانی با تولید کلیپ های  آموزشی به زبان های انگلیسی وآلمانی  توانستیم توانایی مدریسن فارسی زبان را در سطح بین الملل اثبات کنیم
                </p>

                <img className="img-fluid my-3 rounded" src={aboutPic} />
            </Container>
            <Footer />
        </div>
    )
}

export default About;