import img_1 from '../src/assets/Images/AR-1.jpg'
import img_2 from '../src/assets/Images/AR-2.jpg'
import img_3 from '../src/assets/Images/AR-3.jpg'
import img_4 from '../src/assets/Images/AR-4.jpg'
import img_5 from '../src/assets/Images/AR-5.jpg'
import img_6 from '../src/assets/Images/AR-6.jpg'

let articleData = [
    {
        id: 1,
        title: 'کتابخانه های گرافیکی پایتون',
        desc: 'بدون استفاده یکی از کتابخانه های گرافیکی پایتون، توسعه برنامه‌‌های گرافیکی آسان نخواهد بود.این کتابخانه‌ها برای ساخت رابط کاربری گرافیکی استفاه می‌شوند',
        time: ' 11 / اردیبهشت/1403',
        writer: 'مهشید آزادروح',
        img: img_1
    },
    {
        id: 2,
        title: ' هوش مصنوعی چیست؟',
        desc: 'در این مطلب به تفاوت هوش مصنوعی و یادگیری عمیق از جنبه‌های مختلف می‌پردازیم و کاربرد هر یک از این حوزه‌ها را بررسی می‌کنیم.',
        time:' 18 /فروردین/1403',
        writer: 'بهرام میرداماد',
        img: img_2
    },
    {
        id: 3,
        title: "بهترین زبان های  2024",
        desc: "در این مطلب، به زبانی ساده به شما می‌گوییم که بهترین زبان های برنامه نویسی در حوزه‌های مختلف کدامند چگونه آن‌ها را یاد بگیرید.",
        time:   '24/اسفند/1402' ,
        writer: 'پوریا منفرد',
        img: img_3
    },
    {
        id: 4,
        title: 'انواع الگوریتم و کاربرد',
        desc: 'در این مطلب، انواع الگوریتم ها را مورد بررسی قرار داده‌ایم و ضمن معرفی هر یک، کاربردها و خصوصیات آن‌ها را نیز بیان کرده‌ایم.',
        time: '14/بهمن/1402',
        writer: 'احسان فاقد',
        img: img_4
    },
    {
        id: 5,
        title: 'نرمال سازی داده چیست؟',
        desc: 'در این مطلب از مجله کدتایم یاد می‌گیریم نرمال سازی داده چیست و با کاربرد های آن در یادگیری ماشین  و برنامه نویسی آشنا می‌شویم.',
        time: '28/دی/1402',
        writer: 'مینو نساجیان ',
        img: img_5
    },
    {
        id: 6,
        title: 'پازل یادگیری ماشین',
        desc: 'در این مطلب، با انواع روش های مدیریت داده های گمشده در یادگیری ماشین آشنا می‌شویم و نحوه پیاده‌سازی هر کدام را نیز یاد می‌گیریم.',
        time: '7/دی/1402',
        writer: 'حسین زبرجدی',
        img: img_6
    }
];

export default articleData;